update readme and project spec
